Repository: stsbl/iserv-sftp
Catalog: locale/*/stsbl-iserv-sftp.po
Languages: de

source: All stored keys were deleted successful.
de: Alle gespeicherten Schlüssel wurden erfolgreich gelöscht.

source: Define keys for password less login with SFTP
de: Legen Sie die Schlüssel für die passwortlose Anmeldung mit SFTP fest

source: Enter the public keys which start with ssh-rsa (example: ssh-rsa AAAAB3Nza[...]== user@example.com)
de: Geben Sie die öffemtlichen Schlüssel ein, die mit ssh-rsa beginnen (Beispiel: ssh-rsa AAAAB3Nza[...]== user@example.com)

source: For creating a SSH key under Windows, you can follow the guide "%s". For linux, you can follow this guide: "%s". After that, paste the public key in the formular below. Then you can you use the composite SSH private key with an SFTP client to login without a password.
de: Um einen SSH-Schlüssel unter Windows zu erstellen, können Sie dieser Anleitung folgen: "%s". Für Linux folgen Sie dieser Anleitung: "%s". Danach fügen Sie den öffentlichen Schlüssel in das Formular unten ein. Dann können Sie den zugehörigen privaten SSH-Schlüssel nutzen, um sich mit einem SFTP-Client ohne Passwort anzumelden.

source: Keys
de: Schlüssel

source: New key was stored successful.
de: Neuer Schlüssel wurde erfolgreich gespeichert.

source: Profile
de: Profil

source: Public keys
de: Öffentliche Schlüssel

source: Save
de: Speichern

source: Upload public keys for password less login
de: Öffentliche Schlüssel für passwortlosen Login hochladen

source: You must enter a key.
de: Sie müssen einen Schlüssel eingeben.

source: You must enter a valid public key. Did you may enter a private key?
de: Sie müssen einen gültigen öffentlichen Schlüssel eingeben. Haben Sie möglicherweise einen privaten Schlüssel eingegeben?
